Revit 2024 API
PrintManager.SelectNewPrintDriver Method
 Select a new printer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SelectNewPrintDriver(
	string strPrinterName
)
Visual Basic
Public Sub SelectNewPrintDriver ( _
	strPrinterName As String _
)
Visual C++
public:
void SelectNewPrintDriver(
	String^ strPrinterName
)
Parameters
strPrinterName
Type: System.String
The name string of new printer.
Remarks
 This property is the global print setting property for all documents.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument-strPrinterName-is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the assigned new printer is invalid, or the print resource is occupied by others.
See Also
PrintManager Class
Autodesk.Revit.DB Namespace